# git init  ---> Инициализация Git.
# git status ---> Отоброжает текущие состояния Git репозиторияю.
# git add <files>(названия файла)---> Подгатавка файлов перед коммитом.
# git commit ---> Сохраняет текущию версию проекта.
# git checkout <commit hash> ---> Перейти к определённой версии проекта по SHA1 хэшу коммита.
# git checkout <branch name> ---> Переход в определённую версию проекта по названию ветки.
# git commit -m "<message>" ---> Создание коммита с записью изменений в репозитории.
# git log ---> Просмотр истории изменений(коммитов).
